Repository: jtsato/properties-api-netcore
Catalog: EntryPoint.WebApi/Resources/Messages.*.resx
Languages: pt_br

# CommonUnexpectedException
source: An unexpected error has occurred, please try again later!
pt_br: Ocorreu um erro inesperado, por favor tente novamente mais tarde!

# CommonValidationAlert
source: Please correct the errors and send your information again!
pt_br: Favor corrigir os erros e enviar os dados novamente!

# CommonUnexpectedExceptionWithParams
source: An unexpected error has occurred, please try again later! Details: {0}.
pt_br: Ocorreu um erro inesperado, por favor tente novamente mais tarde! Detalhes: {0}.

# CommonInvalidRequest
source: The request received is invalid. Check the format and the parameters in the documentation, correct them and try again.
pt_br: A solicitação recebida é inválida. Verifique o formato e os parâmetros na documentação, corrija-os e tente novamente.

# CommonJsonPropertyMissing
source: The property '{0}' is required.
pt_br: A propriedade '{0}' é obrigatória.

# CommonJsonPropertyInvalid
source: The property '{0}' is invalid.
pt_br: A propriedade '{0}' é inválida.

# CommonJsonPropertyWrongType
source: The property '{0}' has a value not compatible with it's expected types.
pt_br: A propriedade '{0}' possui um valor incompatível com o seu tipo esperado.

# ValidationPropertyFromCreatedAtIsInvalid
source: The initial 'created at' field is invalid.
pt_br: O campo 'criado em' inicial é inválido.

# ValidationPropertyFromUpdatedAtIsInvalid
source: The initial 'updated at' field is invalid.
pt_br: O campo 'atualizado em' inicial é inválido.

# ValidationPropertyToCreatedAtIsInvalid
source: The final 'created at' field is invalid.
pt_br: O campo 'criado em' final é inválido.

# ValidationPropertyToUpdatedAtIsInvalid
source: The final 'updated at' field is invalid.
pt_br: O campo 'atualizado em' final é inválido.

# ValidationPropertyTransactionIsNullOrEmpty
source: The advertise 'transaction' field is required.
pt_br: O campo 'transação' do anúncio é obrigatório.

# ValidationPropertyNotFound
source: No property was found with identifier {0}.
pt_br: O imóvel de identificador {0} não foi encontrado.

# ValidationPropertyIdIsNullOrEmpty
source: The property id is required.
pt_br: O campo 'id' é obrigatório.

# ValidationPropertyNumberOfBedroomsIsInvalid
source: The initial number of bedrooms cannot be greater than the maximum number of bedrooms.
pt_br: O número inicial de quartos não pode ser maior do que o número máximo de quartos.

# ValidationPropertyNumberOfGaragesIsInvalid
source: The initial number of garages cannot be greater than the maximum number of garages.
pt_br: O número inicial de garagens não pode ser maior do que o número máximo de garagens.

# ValidationPropertyNumberOfToiletsIsInvalid
source: The initial number of toilets cannot be greater than the maximum number of toilets.
pt_br: O número inicial de banheiros não pode ser maior do que o número máximo de banheiros.

# ValidationPropertyPriceByM2IsInvalid
source: The initial price per m2 cannot be greater than the maximum price per m2.
pt_br: O preço inicial por metro quadrado não pode ser maior do que o preço máximo por metro quadrado.

# ValidationPropertyRentalPriceIsInvalid
source: The initial rental price cannot be greater than the maximum rental price.
pt_br: O preço inicial de aluguel não pode ser maior do que o preço máximo de aluguel.

# ValidationPropertyRentalTotalPriceIsInvalid
source: The initial rental total price cannot be greater than the maximum rental total price.
pt_br: O preço total inicial de aluguel não pode ser maior do que o preço total máximo de aluguel.

# ValidationPropertySellingPriceIsInvalid
source: The initial selling price cannot be greater than the maximum selling price.
pt_br: O preço de venda inicial não pode ser maior do que o preço de venda máximo.

# ValidationPropertyStatusIsInvalid
source: The property 'status' field is invalid.
pt_br: O campo de 'status' da propriedade é inválido.

# ValidationPropertyTransactionIsInvalid
source: The property 'transaction' field is invalid.
pt_br: O campo 'transação' da propriedade é inválido.

# ValidationPropertyTypesAreInvalid
source: The property 'types' field is required.
pt_br: O campo 'tipo' da propriedade é obrigatório.

# ValidationPropertyBuiltAreaIsInvalid
source: The initial built area cannot exceed the maximum allowed built area.
pt_br: A área construída inicial não pode exceder a área construída máxima permitida.

# ValidationPropertyAreaIsInvalid
source: The initial area cannot exceed the maximum allowed area.
pt_br: A área inicial não pode exceder a área máxima permitida.
